{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyOkzt5P8hd60qJ0Ih9YOlL+"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"code","source":["import pandas as pd\n","from google.colab import drive\n","drive.mount('/content/drive')\n","%cd /content/drive/MyDrive/Colab Notebooks/data_enginer/"],"metadata":{"id":"gH291eu2tUer"},"execution_count":null,"outputs":[]},{"cell_type":"code","execution_count":9,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"cNIvYIKll2Ix","executionInfo":{"status":"ok","timestamp":1696841830565,"user_tz":-420,"elapsed":454,"user":{"displayName":"Andrei Yakovlev","userId":"16152126144074724447"}},"outputId":"2c8b6dc4-83fc-4faf-d8f7-5d6ca4b42fa2"},"outputs":[{"output_type":"stream","name":"stdout","text":["Тестирования задания a ##############\n","Если из списка [1, 3, 5, 5, 3, 6, 7] удалить все элементы с четных позиций, то получим:  [3, 5, 6]\n","Тестирования задания b #############\n","['Аргентина', 'аргентина', 'пироженное', 'АрбУзиНА']\n","Тестирования задания c ############\n","Второй по величине элемент списка [1, 3, 5, 5, 3, 6, 7] - это  6\n","Тестирования задания d ############\n","Если из списка [1, 3, 5, 5, 3, 6, 7] удалить все дубли, то получим:  [1, 3, 5, 6, 7]\n"]}],"source":["# a) Написать программу, которая удаляет из списка все элементы, стоящие на четных позициях.\n","def del_even_ind(arr: list):\n","    return [x for ind, x in enumerate(arr) if ind%2 != 0]\n","\n","\n","# b) Написать программу, которая считывает список слов и находит слова, содержащие более трех гласных букв.\n","def find_word(words: list):\n","    vowels = ['а', 'я', 'у', 'ю', 'о', 'е', 'ё', 'э', 'и', 'ы']\n","    def count_vowels(word: str):\n","        return sum([1 for x in word if x.lower() in vowels])\n","    return [word for word in words if count_vowels(word) > 3]\n","\n","\n","# c) Написать программу, которая находит второй по величине элемент в списке.\n","def second_value(arr: list):\n","    return sorted(arr, reverse=True)[1]\n","\n","\n","# d) Написать программу, которая удаляет из списка все дубликаты.\n","def del_duble(arr: list):\n","    return list(set(arr))\n","\n","\n","if __name__ == '__main__':\n","    arr = [1, 3, 5, 5, 3, 6, 7]\n","    print('Тестирования задания a ##############')\n","    print(f'Если из списка {arr} удалить все элементы с четных позиций, то получим: ', del_even_ind(arr))\n","    print('Тестирования задания b #############')\n","    words = ['Курс', 'Аргентина', 'аргентина', 'пироженное', 'печенье', 'АрбУзиНА']\n","    print(find_word(words))\n","    print('Тестирования задания c ############')\n","    print(f'Второй по величине элемент списка {arr} - это ', second_value(arr))\n","    print('Тестирования задания d ############')\n","    print(f'Если из списка {arr} удалить все дубли, то получим: ', del_duble(arr))"]},{"cell_type":"code","source":["# e) Написать программу, которая считывает данные из CSV-файла и создает словарь,\n","# где ключами являются значения в столбце «Name»,\n","# а значениями — соответствующие им словари с информацией о поле, возрасте и зарплате.\n","def csv_to_dict(file_name: str):\n","    df = pd.read_csv(file_name)\n","    return dict([(i,{'Gender': x,'Age': y,'Salary': z}) for i,x,y,z in zip(df['Name'], df['Gender'],df['Age'],df['Salary'])])\n","\n","dict_staff = csv_to_dict('staff.csv')\n","print(dict_staff)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"MhLeZLg1s3vu","executionInfo":{"status":"ok","timestamp":1696842859913,"user_tz":-420,"elapsed":274,"user":{"displayName":"Andrei Yakovlev","userId":"16152126144074724447"}},"outputId":"f0fe1c14-4c40-4e8c-eb34-58492d2dc126"},"execution_count":21,"outputs":[{"output_type":"stream","name":"stdout","text":["{'Андрей': {'Gender': 'м', 'Age': 25, 'Salary': 40000}, 'Максим': {'Gender': 'м', 'Age': 25, 'Salary': 40000}, 'Ирина': {'Gender': 'ж', 'Age': 25, 'Salary': 40000}}\n"]}]},{"cell_type":"code","source":["# f) Написать программу, которая запрашивает у пользователя строку и\n","# выводит на экран все ее подстроки длиной не менее трех символов.\n","def subsent():\n","    sent = input('введите строку: ')\n","    res = []\n","    if len(sent) < 3:\n","        return 0\n","    for len_str in range(3, len(sent)):\n","        for i in range(0, len(sent) - len_str + 1):\n","            res.append(sent[i:i+len_str])\n","    res.append(sent)\n","    return res\n","\n","\n","\n","subsent()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"NQfqnLXhpupG","executionInfo":{"status":"ok","timestamp":1696843551439,"user_tz":-420,"elapsed":5585,"user":{"displayName":"Andrei Yakovlev","userId":"16152126144074724447"}},"outputId":"31b476d9-9e41-45ac-ff9f-a2e10bc2f2ff"},"execution_count":26,"outputs":[{"name":"stdout","output_type":"stream","text":["введите строку: dfgh hjb\n"]},{"output_type":"execute_result","data":{"text/plain":["['dfg',\n"," 'fgh',\n"," 'gh ',\n"," 'h h',\n"," ' hj',\n"," 'hjb',\n"," 'dfgh',\n"," 'fgh ',\n"," 'gh h',\n"," 'h hj',\n"," ' hjb',\n"," 'dfgh ',\n"," 'fgh h',\n"," 'gh hj',\n"," 'h hjb',\n"," 'dfgh h',\n"," 'fgh hj',\n"," 'gh hjb',\n"," 'dfgh hj',\n"," 'fgh hjb',\n"," 'dfgh hjb']"]},"metadata":{},"execution_count":26}]}]}